<template>
  <div>
    <v-expansion-panels class="pa-4">
      <v-expansion-panel v-for="(item, i) in guides" :key="i" class="mb-4 info">
        <v-expansion-panel-header class="item-title" :aria-label="item.title">
          {{ item.title }}
        </v-expansion-panel-header>
        <v-expansion-panel-content>
          <div v-for="(text, i) in item.description" :key="i" tabindex="0">
            <p v-if="'0123456789'.includes(text.charAt(0))">{{ text }}</p>
            <p class="ml-5" v-else>{{ text }}</p>
          </div>
        </v-expansion-panel-content>
      </v-expansion-panel>
    </v-expansion-panels>
  </div>
</template>

<script>
export default {
  name: "Guide",

  data() {
    return {
      guides: [
        {
          title: "스캔모드",
          description: [
            "1. 스캔모드는 주변 환경을 카메라로 탐색하여 인식된 음료의 제품명을 안내합니다.",
            "2. 하단의 메뉴에서 스캔모드를 눌러 스캔을 시작할 수 있습니다.",
            "3. 스캔모드에서는 자동으로 카메라가 켜지며, 별도의 촬영은 필요하지 않습니다.",
            "4. 화면에 음료가 있다고 판단되면, 자동으로 분석을 시작합니다.",
            "5. 잠시 기다리면 해당 음료에 대한 제품명을 음성으로 안내합니다.",
            '6. 음료 인식이 완료되면 상단에 "세부정보 확인하기" 버튼이 나타납니다.',
            "7. 인식된 음료의 세부정보는 해당 버튼을 눌러 확인할 수 있습니다.",
            "8. 스캔모드 페이지를 벗어나면 카메라는 꺼집니다.",
          ],
        },
        {
          title: "탐색모드",
          description: [
            "1. 원하는 음료가 앞에 있는지 탐색할 수 있는 페이지 입니다.",
            "2. 하단의 메뉴에서 탐색모드를 눌러 탐색을 시작합니다.",
            "3. 즐겨찾기로 등록한 음료 목록에서 탐색을 원하는 음료를 선택합니다.",
            "4. 카메라가 켜지고 스캔모드와 동일하게 주변환경을 카메라를 움직여 탐색합니다.",
            "5. 탐색하고자 설정한 음료와 같은 것으로 인식된 물체가 있을 경우, 음성으로 안내합니다.",
            "6. 해당 음료에 대한 세부 정보를 확인할 수 있습니다.",
            "7. 음료 탐색을 끝내고 싶을 경우, 모드를 변경하거나 뒤로 가기 버튼을 눌러 종료 할 수 있습니다.",
            "8. 탐색하고자 하는  음료 등록, 삭제는 하단의 즐겨찾기 메뉴를 통해 등록이 가능합니다.",
          ],
        },
        {
          title: "즐겨찾기",
          description: [
            "1. 즐겨찾는 음료수를 추가하고 삭제할 수 있는 페이지 입니다.",
            "2. 하단의 메뉴에서 즐겨찾기를 선택합니다.",
            "3. 즐겨찾는 음료수 추가하기",
            "a. 상단에 위치한 상품 추가하기 버튼을 누르면 음료수가 인식할 수 있도록 카메라가 켜집니다.",
            "b. 카메라에 인식된 음료수는 자동으로 저장이 되어 목록에 추가됩니다.",
            "c. 연속으로 추가하고 싶을 경우 뒤로가기를 누르지 않고 이어서 음료수를 인식합니다.",
            "d. 원하는 음료수를 추가한 뒤 뒤로가기를 통하여 음료추가 작업을 끝내고 목록으로 돌아옵니다.",
            "4. 즐겨찾는 음료수 삭제하기",
            "a. 저장되어있는 음료수 목록에서 삭제하고 싶은 음료수를 찾습니다.",
            "b. 해당 음료수와 같은 수평선 오른쪽에 위치한 삭제버튼을 누릅니다.",
            "5. 인터넷 사용 기록을 삭제하거나 기기를 바꾸는 경우 즐겨찾기 목록이 삭제됩니다.",
          ],
        },
        {
          title: "음성지원",
          description: [
            "1. 모지는 스캔모드, 탐색모드, 즐겨찾기에서 음성 안내를 지원합니다.",
            "2. 자체 스크린 리더 사용자는 음성안내를 끄는 것을 추천드립니다.",
            "3. 좌측 상단의 버튼을 눌러 음성안내를 자유롭게 끄고 켤 수 있습니다.",
          ],
        },
      ],
    };
  },
  methods: {
    replaceHtml(input) {
      return input.replace("\n", "<br />");
    },
  },
};
</script>
